IDENTIFICATION DIVISION.
PROGRAM-ID. ADDITION.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUM1 PIC 9(2) VALUE 10.
01 NUM2 PIC 9(2) VALUE 20.
01 RESULT PIC 9(3).

PROCEDURE DIVISION.
    COMPUTE RESULT = NUM1 + NUM2.
    DISPLAY "Sum is: " RESULT.
    STOP RUN.
